This is a notebook to experiment how to establish and extract data from mongodb

In [ ]:
# Connection String
'''
mongodb+srv://sahelkeyvan:<db_password>@cluster0.mzslqvb.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0
'''

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('EasyVisa.csv')
data.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [4]:
data.shape

(25480, 12)

In [5]:
data['case_status'].value_counts()

case_status
Certified    17018
Denied        8462
Name: count, dtype: int64

In [6]:
# to push the data to mongodb, the data needs to be in a dictionary format.
# moongodb stores data in the dictionary format, so we need to cover csv to dict

In [7]:
mongo_data = data.to_dict(orient='records')

In [9]:
len(mongo_data)

25480

In [21]:
# to use mongo db you have to make a database inside a cluster 
# and inside that database you must create a collection

DB_NAME = 'US_VISA'

COLLECTION_NAME = 'VISA_DATA'

CONNECTION_URL = 'mongodb+srv://sahelkeyvan:1374@cluster0.mzslqvb.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0'

In [19]:

from pymongo.mongo_client import MongoClient
from pymongo.server_api import ServerApi

uri = 'mongodb+srv://sahelkeyvan:1374@cluster0.mzslqvb.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0'

# Create a new client and connect to the server
client = MongoClient(uri, server_api=ServerApi('1'))

# Send a ping to confirm a successful connection
try:
    client.admin.command('ping')
    print("Pinged your deployment. You successfully connected to MongoDB!")
except Exception as e:
    print(e)

Pinged your deployment. You successfully connected to MongoDB!

In [22]:
import pymongo
#first buid a client
client = pymongo.MongoClient(CONNECTION_URL)

#build a database in your cluster with your client
data_base = client[DB_NAME]

# build a collection in your database

collection = data_base[COLLECTION_NAME]

# insert data

rec = collection.insert_many(mongo_data)

In [23]:
# now to fetch the data

df = pd.DataFrame(list(collection.find()))

df.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,68b36d7627b66cf0fb600efb,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,68b36d7627b66cf0fb600efc,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,68b36d7627b66cf0fb600efd,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,68b36d7627b66cf0fb600efe,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,68b36d7627b66cf0fb600eff,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [29]:
# remove id
if '_id' in list(df.columns):
    df = df.drop(columns=['_id'], axis = 1)

df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified